{
  "management": [
  {
    "name": "SRI. CH. MALLA REDDY",
    "position": "Founder Chairman",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQpDl_xIOg5YU5Gv45Jl6g-zovtTD-Is6gMFw&s",
    "description": "Our college is a beacon of knowledge, fostering an environment that encourages growth and intellectual curiosity. Together, we strive to nurture a community that values academic excellence, innovation, and inclusivity."
  },
  {
    "name": "SRI. CH. MAHENDER REDDY",
    "position": "Secretary",
    "image": "https://mrec.ac.in/Images/About/messages/bhadra_reddy.jpg",
    "description": "Mr. Mahender Reddy carries forward the pioneering legacy of his visionary father. A multifaceted personality, he redefines the etiquette of quality education with an indomitable team spirit. He serves as a sustainable source of inspiration, fostering innovative thoughts and worthy practices to prepare potential professionals."
  },
  {
    "name": "DR. CH. BHADRA REDDY",
    "position": "President",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS86ZGEhxXYmko8_0ql7cicraDU7CcbrpoI_w&s",
    "description": "As President of MRGI and a medical professional, Dr. Reddy is committed to providing quality education in a conducive environment. He focuses on preparing students for evolving industry demands, ensuring they acquire the knowledge, skills, and mindset necessary to thrive in a dynamic and competitive world."
  },
  {
    "name": "SMT. CH. SHALINI REDDY",
    "position": "Director",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTbQXWlX-FteYmaZ4RAdI4WcJxYHTf6lnJPhA&s",
    "description": "A highly accomplished leader with an MBA, Smt. Shalini Reddy emphasizes academic excellence, critical thinking, and entrepreneurial skills. Her forward-thinking approach and dynamic leadership inspire a culture of innovation, excellence, and holistic development, preparing students for future leadership roles."
  },
  {
    "name": "DR. CH. PREETI REDDY",
    "position": "Vice-Chairman (MRV)",
    "image": "https://yt3.googleusercontent.com/wrQul7m1vQwRgkT8IGkMRbPresRBB7kpmwobibF7hsCDYxefWkAF-CU3w7P9wPGkAi8iNuAA4A=s900-c-k-c0x00ffffff-no-rj",
    "description": "Dr. Preeti Reddy is a dynamic leader dedicated to advancing healthcare and education standards. With a Gold Medal in General Medicine, she drives organizational growth and fosters a culture of high standards. As Vice-Chairman of MRV, she is committed to excellence and innovation in the medical field."
  }
],
"patrons":[
  {
    "name": "Dr.M ASHOK",
    "position": "Patron, Principal",
    "image": "/assets/PFP/principal.jpg",
    "description": "Leading the academic vision and strategic growth of the institution."
  },
  {
    "name": "Dr.Anatha Raman G. R",
    "position": "Patron, HOD",
    "image": "assets/PFP/HOD AI&ML.jpg",
    "description": "Providing guidance and support for departmental excellence and student initiatives."
  },
  {
    "name": "Mr. R. Venkatesh",
    "position": "Patron, Faculty Coordinator",
    "image": "/assets/PFP/venki.jpg",
    "description": "Serving as the primary liaison between the club and the academic administration."
  }
  ]
}

